ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/crypto/cy_crypto.c
/***************************************************************************//**
* \file cy_crypto.c
* \version 1.0
*
* \brief
*  Provides API implementation of the Cypress PDL Crypto driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "crypto/cy_crypto.h"
#include "crypto/cy_crypto_common.h"
#include "ipc/cy_ipc_drv.h"
#include "sysint/cy_sysint.h"
#include "syslib/cy_syslib.h"


#if (CPUSS_CRYPTO_PRESENT == 1)


#if defined(__cplusplus)
extern "C" {
#endif

/* The function prototypes */
void Cy_Crypto_Client_ReleaseIntrHndlr(void);
cy_en_crypto_status_t Cy_Crypto_Client_Send(cy_stc_crypto_context_t const *cryptoContext);


/*
 * The global variable to store a pointer on the customer callback function.
 * This variable is global because it is called from an interrupt.
 */
cy_crypto_callback_ptr_t cy_cryptoCompleteCallbackPtr = NULL;

/*******************************************************************************
* Function Name: Cy_Crypto_Client_ReleaseIntrHndlr
****************************************************************************//**
*
* The interrupt handler for the Crypto IPC Release interrupt; happens
* when Crypto hardware completes operation. This function clears the specific
* interrupt source and calls the customer interrupt handler.
*
*******************************************************************************/
void Cy_Crypto_Client_ReleaseIntrHndlr(void)
{
    uint32_t interruptMasked;

    interruptMasked = Cy_IPC_DRV_GetIntrStatusMasked(Cy_IPC_DRV_GetIntrBaseAddr(CY_CRYPTO_RELEASE_INTR));

    /* Check that there is really the IPC Crypto Release interrupt */
    if((1uL << CY_IPC_CHAN_CRYPTO) == (interruptMasked & IPC_INTR_STRUCT_INTR_MASKED_RELEASE_Msk))
    {
        Cy_IPC_DRV_ClearIntr(Cy_IPC_DRV_GetIntrBaseAddr(CY_IPC_INTR_CRYPTO_M4),
                             (interruptMasked & IPC_INTR_STRUCT_INTR_MASKED_RELEASE_Msk), CY_IPC_NO_NOTIFIFICATION);

        if (cy_cryptoCompleteCallbackPtr != NULL)
        {
            cy_cryptoCompleteCallbackPtr();
        }
    }
}

/*******************************************************************************
* Function Name: Cy_Crypto_IsServerStarted
****************************************************************************//**
*
* Checks if CryptoServer is started.
*
* \return
* True  - CryptoServer is started.
* False - CryptoServer is not started.
*
*******************************************************************************/
bool Cy_Crypto_IsServerStarted(void)
{
    /* Check if the Crypto server started (Crypto IPC Notify interrupt is started) */
    return ((1uL << (CY_IPC_CHAN_CRYPTO + IPC_INTR_STRUCT_INTR_MASK_NOTIFY_Pos)) ==
            (Cy_IPC_DRV_GetIntrMask(Cy_IPC_DRV_GetIntrBaseAddr(CY_CRYPTO_NOTIFY_INTR)) & IPC_INTR_STRUCT_INTR_MASK_NOTIFY_Msk));
}

/*******************************************************************************
* Function Name: Cy_Crypto_IsServerReady
****************************************************************************//**
*
* Checks if CryptoServer is ready for operations.
*
* \return
* True  - CryptoServer is ready.
* False - CryptoServer is not ready.
*
*******************************************************************************/
bool Cy_Crypto_IsServerReady(void)
{
    return (CY_IPC_DRV_LOCKED != Cy_IPC_DRV_GetLockStatus(Cy_IPC_DRV_GetIpcBaseAddress(CY_IPC_CHAN_CRYPTO)));
}

/*******************************************************************************
* Function Name: Cy_Crypto_Sync
****************************************************************************//**
*
* The synchronization function that waits or just checks (depending on the parameter)
* for the Crypto operation to complete.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param isBlocking
* Set whether Crypto_Sync is blocking or not:
* True - is blocking.
* False - is not blocking.
*
* \return
* True  - Crypto HW is ready to new task.
* False - Crypto HW is busy.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Sync(cy_stc_crypto_context_t const *cryptoContext, bool isBlocking)
{
    cy_en_crypto_status_t status = CY_CRYPTO_NOT_INITIALIZED;

    if (CY_CRYPTO_INSTR_UNKNOWN != cryptoContext->instr)
    {
      status = CY_CRYPTO_SERVER_NOT_STARTED;

      /* Check if the Crypto server started (Crypto IPC Notify interrupt is started) */
      if (Cy_Crypto_IsServerStarted())
      {

        if (!isBlocking)
        {
            status = CY_CRYPTO_SERVER_BUSY;

            if (Cy_Crypto_IsServerReady())
            {
                status = cryptoContext->resp;
            }
        }
        else
        {
            while (!Cy_Crypto_IsServerReady())
            {
            }

            status = cryptoContext->resp;
        }
      }
    }

    return (status);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Client_Send
****************************************************************************//**
*
* Sends a pointer to the Crypto Server.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Client_Send(cy_stc_crypto_context_t const *cryptoContext)
{
    cy_en_crypto_status_t status = CY_CRYPTO_SERVER_NOT_STARTED;

    if (Cy_Crypto_IsServerStarted())
    {
      status = CY_CRYPTO_SERVER_BUSY;

      if (Cy_Crypto_IsServerReady())
      {
        status = CY_CRYPTO_SUCCESS;

