ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/crypto/cy_crypto.c
        if (CY_IPC_DRV_SUCCESS != Cy_IPC_DRV_SendMsgPtr(Cy_IPC_DRV_GetIpcBaseAddress(CY_IPC_CHAN_CRYPTO), (1uL << CY_IPC_INTR_CRYPTO_M0), cryptoContext))
        {
            status = CY_CRYPTO_COMM_FAIL;
        }
      }
    }

    return (status);
}

/*******************************************************************************
* Function Name: Cy_Crypto_GetErrorStatus
****************************************************************************//**
*
* The function returns a cause of a Crypto hardware error.
* This function is independent of the Crypto previous state.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param hwErrorCause
* \ref cy_stc_crypto_hw_error_t.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_GetErrorStatus(const cy_stc_crypto_context_t *cryptoContext,
                                               cy_stc_crypto_hw_error_t *hwErrorCause)
{
    if(NULL != hwErrorCause)
    {
        hwErrorCause->errorStatus0 = cryptoContext->hwErrorStatus.errorStatus0;
        hwErrorCause->errorStatus1 = cryptoContext->hwErrorStatus.errorStatus1;
    }

    return (cryptoContext->resp);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Init
****************************************************************************//**
*
* Initializes the Crypto context buffer and
* interrupt for the Crypto callback. Must be called at first.
*
* To start working with Crypto methods after Crypto_Init(),
* call Crypto_Enable() to turn-on the Crypto Hardware.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param configStruct
* The pointer to the Crypto configuration structure.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Init(cy_stc_crypto_context_t *cryptoContext,
                                     cy_stc_crypto_config_t const *configStruct)
{
    cy_stc_sysint_t intrCfg;
    cy_en_crypto_status_t status = CY_CRYPTO_SERVER_NOT_STARTED;

    /* Release the Crypto IPC channel with the Release interrupt */
    (void)Cy_IPC_DRV_Release(Cy_IPC_DRV_GetIpcBaseAddress(CY_IPC_CHAN_CRYPTO), CY_IPC_NO_NOTIFIFICATION);

    cryptoContext->instr = CY_CRYPTO_INSTR_ENABLE;

    /* Check if the Crypto server started (Crypto IPC Notify interrupt is started) */
    if (Cy_Crypto_IsServerStarted())
    {
        /* Set up a Release interrupt if the customer wants */
        if(NULL != configStruct->userCompleteCallback)
        {
            intrCfg.intrSrc = (IRQn_Type)(cpuss_interrupts_ipc0_IRQn + CY_CRYPTO_RELEASE_INTR);
            intrCfg.intrCm0p = (IRQn_CM0P_Type)(configStruct->cm0ReleaseIntrNum);
            intrCfg.intrPriority = configStruct->releaseIntrPrior;
            Cy_SysInt_Init(&intrCfg, &Cy_Crypto_Client_ReleaseIntrHndlr);

            cy_cryptoCompleteCallbackPtr = configStruct->userCompleteCallback;

            /* Set up the IPC Release interrupt here */
            Cy_IPC_DRV_SetIntrMask(Cy_IPC_DRV_GetIntrBaseAddr(CY_CRYPTO_RELEASE_INTR), (1uL << CY_IPC_CHAN_CRYPTO), CY_IPC_NO_NOTIFIFICATION);

#if (CY_CPU_CORTEX_M0P)
            NVIC_EnableIRQ((IRQn_Type)intrCfg.intrCm0p);
#else
            NVIC_EnableIRQ((IRQn_Type)intrCfg.intrSrc);
#endif
        }

        status = CY_CRYPTO_SUCCESS;
    }

    return(status);
}

/*******************************************************************************
* Function Name: Cy_Crypto_DeInit
****************************************************************************//**
*
* The function to de-initialize the Crypto driver.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param configStruct
* The pointer to the Crypto configuration structure.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_DeInit(cy_stc_crypto_context_t *cryptoContext,
                                       cy_stc_crypto_config_t const *configStruct)
{
    uint32_t interruptMasked;
    cy_en_crypto_status_t err = CY_CRYPTO_SUCCESS;

    cryptoContext->instr = CY_CRYPTO_INSTR_UNKNOWN;

    /* If the release interrupt was enable, disable it here */
    if(NULL != configStruct->userCompleteCallback)
    {
        /* Disable the Release interrupt from IPC */
#if (CY_CPU_CORTEX_M0P)
        NVIC_DisableIRQ((IRQn_Type)configStruct->cm0ReleaseIntrNum);
#else
        NVIC_DisableIRQ((IRQn_Type)(cpuss_interrupts_ipc0_IRQn + CY_IPC_INTR_CRYPTO_M4));
#endif
        /* Reset up the IPC Release interrupt here */
        interruptMasked = Cy_IPC_DRV_GetIntrStatusMasked(Cy_IPC_DRV_GetIntrBaseAddr(CY_CRYPTO_RELEASE_INTR));

        /* Check that there is really the IPC Crypto Release interrupt */
        if((1uL << CY_IPC_CHAN_CRYPTO) == (interruptMasked & IPC_INTR_STRUCT_INTR_MASK_RELEASE_Msk))
        {
            Cy_IPC_DRV_ClearIntr(Cy_IPC_DRV_GetIntrBaseAddr(CY_IPC_INTR_CRYPTO_M4), (interruptMasked & IPC_INTR_STRUCT_INTR_MASK_RELEASE_Msk), CY_IPC_NO_NOTIFIFICATION);
        }
    }

    return (err);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Enable
****************************************************************************//**
*
* Enable the Crypo hardware.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Enable(cy_stc_crypto_context_t *cryptoContext)
{
    cy_en_crypto_status_t err;

