ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/crypto/cy_crypto.c
    cryptoContext->instr = CY_CRYPTO_INSTR_ENABLE;
    cryptoContext->xdata = NULL;

    err = Cy_Crypto_Client_Send(cryptoContext);

    /* Wait until initialization completes */
    if (CY_CRYPTO_SUCCESS == err)
    {
      err = Cy_Crypto_Sync(cryptoContext, CY_CRYPTO_SYNC_BLOCKING);
    }

    return (err);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Disable
****************************************************************************//**
*
* Disables the Crypto hardware.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Disable(cy_stc_crypto_context_t *cryptoContext)
{
    cy_en_crypto_status_t err;

    cryptoContext->instr = CY_CRYPTO_INSTR_DISABLE;
    cryptoContext->xdata = NULL;

    err = Cy_Crypto_Client_Send(cryptoContext);

    /* Wait until initialization completes */
    if (CY_CRYPTO_SUCCESS == err)
    {
      err = Cy_Crypto_Sync(cryptoContext, CY_CRYPTO_SYNC_BLOCKING);
    }

   return (err);
}

#if ((CPUSS_CRYPTO_PR == 1) && (CY_CRYPTO_USER_PR == 1))
/*******************************************************************************
* Function Name: Cy_Crypto_Prng_Init
****************************************************************************//**
*
* This function initializes parameters of the PRND.
* Resets the pseudo random sequence.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoPrngContext
* The pointer to the \ref cy_stc_crypto_context_prng_t structure which stores
* the Crypto function context.
*
* \param lfsr32InitState
* A non-zero seed value for the first LFSR.

* \param lfsr31InitState
* A non-zero seed value for the second LFSR.

* \param lfsr29InitState
* A non-zero seed value for the third LFSR
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Prng_Init(cy_stc_crypto_context_t *cryptoContext,
                                          cy_stc_crypto_context_prng_t *cryptoPrngContext,
                                          const uint32_t lfsr32InitState,
                                          const uint32_t lfsr31InitState,
                                          const uint32_t lfsr29InitState)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_PRNG_INIT;
    cryptoContext->xdata = (void *)cryptoPrngContext;

    cryptoPrngContext->lfsr32InitState = lfsr32InitState;
    cryptoPrngContext->lfsr31InitState = lfsr31InitState;
    cryptoPrngContext->lfsr29InitState = lfsr29InitState;

    return (Cy_Crypto_Client_Send(cryptoContext));
}

/*******************************************************************************
* Function Name: Cy_Crypto_Prng_Generate
****************************************************************************//**
*
* Generates the Pseudo Random Number.
* This function is dependent on Cy_Crypto_Prng_Init which should be called before.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoPrngContext
* The pointer to the \ref cy_stc_crypto_context_prng_t structure which stores
* the Crypto function context.
*
* \param max
* The maximum value of a random number.
*
* \param rndNumPtr
* The pointer to a generated pseudo random number.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Prng_Generate(cy_stc_crypto_context_t *cryptoContext,
                                              cy_stc_crypto_context_prng_t *cryptoPrngContext,
                                               uint32_t const max,
                                               uint32_t *rndNumPtr)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_PRNG;
    cryptoContext->xdata = (void *)cryptoPrngContext;

    cryptoPrngContext->max = max;
    cryptoPrngContext->prngNumPtr = rndNumPtr;

    return (Cy_Crypto_Client_Send(cryptoContext));
}
#endif /* #if ((CPUSS_CRYPTO_PR == 1) && (CY_CRYPTO_USER_PR == 1)) */

#if ((CPUSS_CRYPTO_AES == 1) && (CY_CRYPTO_USER_AES_ENABLE == 1))
/*******************************************************************************
* Function Name: Cy_Crypto_Aes_Init
****************************************************************************//**
*
* Initialize the AES operation by setting key and key length.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoAesContext
* The pointer to the \ref cy_stc_crypto_context_aes_t structure which stores all internal variables
* the Crypto driver requires.
*
* \param keyPtr
* The pointer to the encryption/decryption key.
*
* \param keyLength
* One of these: CRYPTO_AES_128, CRYPTO_AES_192 or CRYPTO_AES_256.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Aes_Init(cy_stc_crypto_context_t *cryptoContext,
                                         cy_stc_crypto_context_aes_t *cryptoAesContext,
                                         uint32_t *keyPtr,
                                         cy_en_crypto_aes_key_length_t keyLength)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_AES_INIT;
    cryptoContext->xdata = cryptoAesContext;

    cryptoAesContext->aesState.keyPtr = keyPtr;
    cryptoAesContext->aesState.keyLength = keyLength;

    return (Cy_Crypto_Client_Send(cryptoContext));
}

#if (CY_CRYPTO_USER_AES_ECB == 1)
/*******************************************************************************
* Function Name: Cy_Crypto_Aes_Ecb_Run
****************************************************************************//**
*
* Performs AES operation on one Block.
* This function is dependent from Cy_Crypto_Aes_Init which should be called before.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoAesContext
* The pointer to the \ref cy_stc_crypto_context_aes_t structure which stores all internal variables
* the Crypto driver requires.
*
* \param dirMode
* Can be CRYPTO_ENCRYPT or CRYPTO_DECRYPT.
*
* \param srcBlockPtr
* The pointer to a source block.
*
* \param dstBlockPtr
* The pointer to a destination cipher block.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Aes_Ecb_Run(cy_stc_crypto_context_t *cryptoContext,
                                            cy_stc_crypto_context_aes_t *cryptoAesContext,
                                            cy_en_crypto_dir_mode_t dirMode,
                                            uint32_t *dstBlockPtr,
                                            uint32_t *srcBlockPtr)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_AES_ECB;
    cryptoContext->xdata = cryptoAesContext;

    cryptoAesContext->dirMode = dirMode;
    cryptoAesContext->dstPtr = dstBlockPtr;
    cryptoAesContext->srcPtr = srcBlockPtr;

    return (Cy_Crypto_Client_Send(cryptoContext));
}
#endif /* #if (CY_CRYPTO_USER_AES_ECB == 1) */

#if (CY_CRYPTO_USER_AES_CBC == 1)
/*******************************************************************************
* Function Name: Cy_Crypto_Aes_Cbc_Run
****************************************************************************//**
*
* Performs AES operation on a plain text with Cipher Block Chaining (CBC).
* This function is dependent from Cy_Crypto_Aes_Init which should be called before.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoAesContext
* The pointer to the \ref cy_stc_crypto_context_aes_t structure which stores all internal variables
* the Crypto driver requires.
*
* \param dirMode
* Can be CRYPTO_ENCRYPT or CRYPTO_DECRYPT.
*
* \param srcSize
* The size of the source plain text.
*
* \param ivPtr
* The pointer to the initial vector.
*
* \param dstPtr
* The pointer to a destination cipher text.
*
* \param srcPtr
* The pointer to a source plain text. Must be 4-Byte aligned!
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Aes_Cbc_Run(cy_stc_crypto_context_t *cryptoContext,
                                            cy_stc_crypto_context_aes_t *cryptoAesContext,
                                            cy_en_crypto_dir_mode_t dirMode,
                                            uint32_t srcSize,
                                            uint32_t *ivPtr,
                                            uint32_t *dstPtr,
                                            uint32_t *srcPtr)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_AES_CBC;
    cryptoContext->xdata = cryptoAesContext;

    cryptoAesContext->dirMode = dirMode;
    cryptoAesContext->srcSize = srcSize;
    cryptoAesContext->ivPtr = ivPtr;
    cryptoAesContext->dstPtr = dstPtr;
    cryptoAesContext->srcPtr = srcPtr;

    return (Cy_Crypto_Client_Send(cryptoContext));
}
#endif /* #if (CY_CRYPTO_USER_AES_CBC == 1) */

#if (CY_CRYPTO_USER_AES_CFB == 1)
/*******************************************************************************
* Function Name: Cy_Crypto_Aes_Cfb_Run
****************************************************************************//**
*
* Performs AES operation on a plain text with Cipher Feedback mode (CFB).
* This function is dependent from Cy_Crypto_Aes_Init
* which should be called before.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoAesContext
* The pointer to the \ref cy_stc_crypto_context_aes_t structure which stores all internal variables
* the Crypto driver requires.
*
* \param dirMode
* Can be CRYPTO_ENCRYPT or CRYPTO_DECRYPT.
*
* \param srcSize
* The size of the source plain text.
*
* \param ivPtr
* The pointer to the initial vector.
*
* \param dstPtr
* The pointer to a destination cipher text.
*
* \param srcPtr
* The pointer to a source plain text. Must be 4-Byte aligned!
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Aes_Cfb_Run(cy_stc_crypto_context_t *cryptoContext,
                                            cy_stc_crypto_context_aes_t *cryptoAesContext,
                                            cy_en_crypto_dir_mode_t dirMode,
                                            uint32_t srcSize,
                                            uint32_t *ivPtr,
                                            uint32_t *dstPtr,
                                            uint32_t *srcPtr)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_AES_CFB;
    cryptoContext->xdata = cryptoAesContext;

    cryptoAesContext->dirMode = dirMode;
    cryptoAesContext->srcSize = srcSize;
    cryptoAesContext->ivPtr = ivPtr;
    cryptoAesContext->dstPtr = dstPtr;
    cryptoAesContext->srcPtr = srcPtr;

    return (Cy_Crypto_Client_Send(cryptoContext));
}
#endif /* #if (CY_CRYPTO_USER_AES_CFB == 1) */

#if (CY_CRYPTO_USER_AES_CTR == 1)
/*******************************************************************************
* Function Name: Cy_Crypto_Aes_Ctr_Run
****************************************************************************//**
*
* Performs AES operation on a plain text with Cipher Block Counter mode (CTR).
* NOTE: preparation of the unique nonceCounter for each block is
* the user's responsibility. This function is dependent from
* Cy_Crypto_Aes_Init which should be called before.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoAesContext
* The pointer to the \ref cy_stc_crypto_context_aes_t structure which stores all internal variables
* the Crypto driver requires.
*
* \param dirMode
* Can be CRYPTO_ENCRYPT or CRYPTO_DECRYPT.
*
* \param srcSize
* The size of a source plain text.
*
* \param srcOffset
* The size of an offset within the current block stream for resuming within the current cipher stream.
*
* \param nonceCounter
* The 128-bit nonce and counter.
*
* \param streamBlock
* The saved stream-block for resuming, is over-written by the function.
*
* \param dstPtr
* The pointer to a destination cipher text.
*
* \param srcPtr
* The pointer to a source plain text. Must be 4-Byte aligned!
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Aes_Ctr_Run(cy_stc_crypto_context_t *cryptoContext,
                                            cy_stc_crypto_context_aes_t *cryptoAesContext,
                                            cy_en_crypto_dir_mode_t dirMode,
                                            uint32_t srcSize,
                                            uint32_t *srcOffset,
                                            uint32_t nonceCounter[CY_CRYPTO_AES_BLOCK_SIZE / 8u],
                                            uint32_t streamBlock[CY_CRYPTO_AES_BLOCK_SIZE / 8u],
                                            uint32_t *dstPtr,
                                            uint32_t *srcPtr)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_AES_CTR;
    cryptoContext->xdata = cryptoAesContext;

    cryptoAesContext->dirMode = dirMode;
    cryptoAesContext->srcSize = srcSize;
    cryptoAesContext->srcOffset = srcOffset;
    cryptoAesContext->ivPtr = nonceCounter;
    cryptoAesContext->streamBlock = streamBlock;
    cryptoAesContext->dstPtr = dstPtr;
    cryptoAesContext->srcPtr = srcPtr;

    return (Cy_Crypto_Client_Send(cryptoContext));
}
#endif /* #if (CY_CRYPTO_USER_AES_CTR == 1) */

#if (CY_CRYPTO_USER_CMAC == 1)
/*******************************************************************************
* Function Name: Cy_Crypto_Aes_Cmac_Run
****************************************************************************//**
*
* Performs the cipher-block chaining-message authentication-code.
* This function is independent of the previous Crypto state.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoAesContext
* The pointer to the \ref cy_stc_crypto_context_aes_t structure which stores all internal variables
* the Crypto driver requires.
*
* \param srcPtr
* The pointer to a source plain text. Must be 4-Byte aligned!
*
* \param srcSize
* The size of a source plain text.
*
* \param keyPtr
* The pointer to the encryption key.
*
* \param keyLength
* One of these: \ref cy_en_crypto_aes_key_length_t
*
* \param cmacPtr
* The pointer to the calculated CMAC.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Aes_Cmac_Run(cy_stc_crypto_context_t *cryptoContext,
                                             cy_stc_crypto_context_aes_t *cryptoAesContext,
                                             uint32_t *srcPtr,
                                             uint32_t srcSize,
                                             uint32_t *keyPtr,
                                             cy_en_crypto_aes_key_length_t keyLength,
                                             uint32_t *cmacPtr)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_CMAC;
    cryptoContext->xdata = cryptoAesContext;

    cryptoAesContext->srcSize = srcSize;
    cryptoAesContext->dstPtr = cmacPtr;
    cryptoAesContext->srcPtr = srcPtr;
    cryptoAesContext->aesState.keyPtr = keyPtr;
    cryptoAesContext->aesState.keyLength = keyLength;

    return (Cy_Crypto_Client_Send(cryptoContext));
}
#endif /* #if (CY_CRYPTO_USER_CMAC == 1) */

#endif /* #if ((CPUSS_CRYPTO_AES == 1) && (CY_CRYPTO_USER_AES_ENABLE == 1)) */

#if ((CPUSS_CRYPTO_SHA == 1) && (CY_CRYPTO_USER_SHA_ENABLE == 1))
/*******************************************************************************
* Function Name: Cy_Crypto_Sha_Run
****************************************************************************//**
*
* Performs the SHA Hash function.
* This function is independent of the previous Crypto state.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoShaContext
* the pointer to the \ref cy_stc_crypto_context_sha_t structure which stores all internal variables
* for Crypto driver.
*
* \param mode
* One of CRYPTO_SHA256, CRYPTO_SHA1, CRYPTO_SHA256_224, CRYPTO_SHA512,
*        CRYPTO_SHA384, CRYPTO_SHA512_224, CRYPTO_SHA512_256.
*
* \param messagePtr
* The pointer to a message whose hash value is being computed.
*
* \param messageSize
* The size of a message.
*
* \param digestPtr
* The pointer to the hash digest .
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Sha_Run(cy_stc_crypto_context_t *cryptoContext,
                                        cy_stc_crypto_context_sha_t *cryptoShaContext,
                                        uint32_t *messagePtr,
                                        uint32_t messageSize,
                                        uint32_t *digestPtr,
                                        cy_en_crypto_sha_mode_t mode)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_SHA;
    cryptoContext->xdata = cryptoShaContext;

    cryptoShaContext->messagePtr = messagePtr;
    cryptoShaContext->messageSize = messageSize;
    cryptoShaContext->dstPtr = digestPtr;
    cryptoShaContext->mode = mode;

    return (Cy_Crypto_Client_Send(cryptoContext));
}
#endif /* #if ((CPUSS_CRYPTO_SHA == 1) && (CY_CRYPTO_USER_SHA_ENABLE == 1)) */

#if ((CPUSS_CRYPTO_SHA == 1) && (CY_CRYPTO_USER_HMAC == 1))
/*******************************************************************************
* Function Name: Cy_Crypto_Hmac_Run
****************************************************************************//**
*
* Performs HMAC calculation.
* This function is independent of the previous Crypto state.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoShaContext
* the pointer to the \ref cy_stc_crypto_context_sha_t structure which stores all internal variables
* for Crypto driver.
*
* \param hmacPtr
* The pointer to the calculated HMAC .
*
* \param messagePtr
* The pointer to a message whose hash value is being computed.
*
* \param messageSize
* The size of a message.
*
* \param keyPtr
* The pointer to the key.
*
* \param keyLength
* The length of the key.
*
* \param mode
* One of these: CRYPTO_SHA256, CRYPTO_SHA1, CRYPTO_SHA256_224, CRYPTO_SHA512,
*               CRYPTO_SHA384, CRYPTO_SHA512_224, CRYPTO_SHA512_256.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Hmac_Run(cy_stc_crypto_context_t *cryptoContext,
                                         cy_stc_crypto_context_sha_t *cryptoShaContext,
                                         uint32_t *hmacPtr,
                                         uint32_t *messagePtr,
                                         uint32_t messageSize,
                                         uint32_t *keyPtr,
                                         uint32_t keyLength,
                                         cy_en_crypto_sha_mode_t mode)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_HMAC;
    cryptoContext->xdata = cryptoShaContext;

    cryptoShaContext->messagePtr = messagePtr;
    cryptoShaContext->messageSize = messageSize;
    cryptoShaContext->dstPtr = hmacPtr;
    cryptoShaContext->mode = mode;
    cryptoShaContext->keyPtr = keyPtr;
    cryptoShaContext->keyLength = keyLength;

    return (Cy_Crypto_Client_Send(cryptoContext));
}
#endif /* #if ((CPUSS_CRYPTO_SHA == 1) && (CY_CRYPTO_USER_HMAC == 1)) */

#if ((CPUSS_CRYPTO_STR == 1) && (CY_CRYPTO_USER_STR == 1))
/*******************************************************************************
* Function Name: Cy_Crypto_Str_MemCpy
****************************************************************************//**
*
* Function MemCpy that uses Crypto HW.
* Memory structures should not overlap!
* There is no alignment restriction.
* This function is independent of the previous Crypto state.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoMemContext
* the pointer to the \ref cy_stc_crypto_context_str_t structure which stores all internal variables
* for Crypto driver.
*
* \param dstPtr
* The pointer to the destination of MemCpy.
*
* \param srcPtr
* The pointer to the source of MemCpy.
*
* \param size
* The size in bytes of the copy operation. Maximum size is 65535 Bytes.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Str_MemCpy(cy_stc_crypto_context_t *cryptoContext,
                                           cy_stc_crypto_context_str_t *cryptoMemContext,
                                           void* dstPtr,
                                           void const *srcPtr,
                                           uint16_t size)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_MEM_CPY;
    cryptoContext->xdata = cryptoMemContext;

    cryptoMemContext->dstPtr = dstPtr;
    cryptoMemContext->srcPtr0 = srcPtr;
    cryptoMemContext->dataSize = size;

    return(Cy_Crypto_Client_Send(cryptoContext));
}

