ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/crypto/cy_crypto.c
/*******************************************************************************
* Function Name: Cy_Crypto_Str_MemSet
****************************************************************************//**
*
* Function MemSet uses Crypto HW.
* There is no alignment restriction.
* This function is independent from the previous Crypto state.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoMemContext
* the pointer to the \ref cy_stc_crypto_context_str_t structure which stores all internal variables
* for Crypto driver.
*
* \param dstPtr
* The pointer to the destination of MemSet.
*
* \param data
* The value to be set.
*
* \param size
* The size in bytes of the set operation. Maximum size is 65535 Bytes.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Str_MemSet(cy_stc_crypto_context_t *cryptoContext,
                                           cy_stc_crypto_context_str_t *cryptoMemContext,
                                           void* dstPtr,
                                           uint8_t data,
                                           uint16_t size)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_MEM_SET;
    cryptoContext->xdata = cryptoMemContext;

    cryptoMemContext->dstPtr = dstPtr;
    cryptoMemContext->data = data;
    cryptoMemContext->dataSize = size;

    return (Cy_Crypto_Client_Send(cryptoContext));
}

/*******************************************************************************
* Function Name: Cy_Crypto_Str_MemCmp
****************************************************************************//**
*
* Function MemCmp uses Crypto HW.
* There is no alignment restriction.
* This function is independent from the previous Crypto state.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoMemContext
* the pointer to the \ref cy_stc_crypto_context_str_t structure which stores all internal variables
* for Crypto driver.
*
* \param src0Ptr
* The pointer to the first source of MemCmp.
*
* \param src1Ptr
* The pointer to the second source of MemCmp.
*
* \param size
* The size in bytes of the compare operation. Maximum size is 65535 Bytes.
*
* \param resultPtr
* The pointer to the result: 0 - if Source 1 = Source 2, 1 - if not.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Str_MemCmp(cy_stc_crypto_context_t *cryptoContext,
                                           cy_stc_crypto_context_str_t *cryptoMemContext,
                                           void const *src0Ptr,
                                           void const *src1Ptr,
                                           uint16_t size,
                                           uint32_t *resultPtr)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_MEM_CMP;
    cryptoContext->xdata = cryptoMemContext;

    cryptoMemContext->srcPtr0 = src0Ptr;
    cryptoMemContext->srcPtr1 = src1Ptr;
    cryptoMemContext->dataSize = size;
    cryptoMemContext->dstPtr = (void* )resultPtr;

    return (Cy_Crypto_Client_Send(cryptoContext));
}

/*******************************************************************************
* Function Name: Crypto_Str_MemXor
****************************************************************************//**
*
* Function MemXor uses Crypto HW.
* Memory structures should not overlap!
* There is no alignment restriction.
* This function is independent from the previous Crypto state.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoMemContext
* the pointer to the \ref cy_stc_crypto_context_str_t structure which stores all internal variables
* for Crypto driver.
*
* \param src0Ptr
* The pointer to the first source of MemXor.

* \param src1Ptr
* The pointer to the second source of MemXor.

* \param dstPtr
* The pointer to the destination of MemXor.
*
* \param size
* The size in bytes of the compare operation. Maximum size is 65535 Bytes.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Str_MemXor(cy_stc_crypto_context_t *cryptoContext,
                                           cy_stc_crypto_context_str_t *cryptoMemContext,
                                           void const *src0Ptr,
                                           void const *src1Ptr,
                                           void* dstPtr,
                                           uint16_t size)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_MEM_XOR;
    cryptoContext->xdata = cryptoMemContext;

    cryptoMemContext->srcPtr0 = src0Ptr;
    cryptoMemContext->srcPtr1 = src1Ptr;
    cryptoMemContext->dstPtr = dstPtr;
    cryptoMemContext->dataSize = size;

    return(Cy_Crypto_Client_Send(cryptoContext));
}
#endif /* #if ((CPUSS_CRYPTO_STR == 1) && (CY_CRYPTO_USER_STR == 1)) */

#if ((CPUSS_CRYPTO_CRC == 1) && (CY_CRYPTO_USER_CRC == 1))
/*******************************************************************************
* Function Name: Cy_Crypto_Crc_Init
****************************************************************************//**
*
* Performs CRC initialization.
* The peculiarity of CRC hardware block is that for some polynomials
* calculated CRC is MSB aligned, for another is LSB aligned.
* Here below is the table with knowing polynomials and their
* calculated CRCs from the string "123456789".
*
*  <table>
*  <caption id="crc_modes_table">CRC modes and parameters</caption>
*   <tr><th>Name</th><th>Width</th><th>Poly</th><th>Init</th><th>Data Rev</th><th>Data XOR</th><th>Rem Rev</th><th>Rem XOR</th><th>Expected CRC</th><th>Output of the CRC block</th>
*   </tr>
*   <tr>
*     <td>CRC-3 / ROHC</td><td>3</td><td>0x3</td><td>0x7</td><td>1</td><td>0</td><td>1</td><td>0x0</td><td>0x6</td><td>0x00000006</td>
*   </tr>
*   <tr>
*     <td>CRC-4 / ITU</td><td>4</td><td>0x3</td><td>0x0</td><td>1</td><td>0</td><td>1</td><td>0x0</td><td>0x7</td><td>0x00000007</td>
*   </tr>
*   <tr>
*     <td>CRC-5 / EPC</td><td>5</td><td>0x9</td><td>0x9</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0x0</td><td>0x00000000</td>
*   </tr>
*   <tr>
*     <td>CRC-5 / ITU</td><td>5</td><td>0x15</td><td>0x0</td><td>1</td><td>0</td><td>1</td><td>0x0</td><td>0x7</td><td>0x00000007</td>
*   </tr>
*   <tr>
*     <td>CRC-5 / USB</td><td>5</td><td>0x5</td><td>0x1F</td><td>1</td><td>0</td><td>1</td><td>0x1F</td><td>0x19</td><td>0x00000019</td>
*   </tr>
*   <tr>
*     <td>CRC-6 / CDMA2000-A</td><td>6</td><td>0x27</td><td>0x3F</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0xD</td><td>0xD0000000</td>
*   </tr>
*   <tr>
*     <td>CRC-6 / CDMA2000-B</td><td>6</td><td>0x7</td><td>0x3F</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0x3B</td><td>0x3B000000</td>
*   </tr>
*   <tr>
*     <td>CRC-6 / DARC</td><td>6</td><td>0x19</td><td>0x0</td><td>1</td><td>0</td><td>1</td><td>0x0</td><td>0x26</td><td>0x00000026</td>
*   </tr>
*   <tr>
*     <td>CRC-6 / ITU</td><td>6</td><td>0x3</td><td>0x0</td><td>1</td><td>0</td><td>1</td><td>0x0</td><td>0x6</td><td>0x00000006</td>
*   </tr>
*   <tr>
*     <td>CRC-7</td><td>7</td><td>0x9</td><td>0x0</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0x75</td><td>0x75000000</td>
*   </tr>
*   <tr>
*     <td>CRC-7 / ROHC</td><td>7</td><td>0x4F</td><td>0x7F</td><td>1</td><td>0</td><td>1</td><td>0x0</td><td>0x53</td><td>0x00000053</td>
*   </tr>
*   <tr>
*     <td>CRC-8</td><td>8</td><td>0x7</td><td>0x0</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0xF4</td><td>0xF4000000</td>
*   </tr>
*   <tr>
*     <td>CRC-8 / CDMA2000</td><td>8</td><td>0x9B</td><td>0xFF</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0xDA</td><td>0xDA000000</td>
*   </tr>
*   <tr>
*     <td>CRC-8 / DARC</td><td>8</td><td>0x39</td><td>0x0</td><td>1</td><td>0</td><td>1</td><td>0x0</td><td>0x15</td><td>0x00000015</td>
*   </tr>
*   <tr>
*     <td>CRC-8 / DVB-S2</td><td>8</td><td>0xD5</td><td>0x0</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0xBC</td><td>0xBC000000</td>
*   </tr>
*   <tr>
*     <td>CRC-8 / EBU</td><td>8</td><td>0x1D</td><td>0xFF</td><td>1</td><td>0</td><td>1</td><td>0x0</td><td>0x97</td><td>0x00000097</td>
*   </tr>
*   <tr>
*     <td>CRC-8 / I-CODE</td><td>8</td><td>0x1D</td><td>0xFD</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0x7E</td><td>0x7E000000</td>
*   </tr>
*   <tr>
*     <td>CRC-8 / ITU</td><td>8</td><td>0x7</td><td>0x0</td><td>0</td><td>0</td><td>0</td><td>0x55</td><td>0xA1</td><td>0xA1000000</td>
*   </tr>
*   <tr>
*     <td>CRC-8 / MAXIM</td><td>8</td><td>0x31</td><td>0x0</td><td>1</td><td>0</td><td>1</td><td>0x0</td><td>0xA1</td><td>0x000000A1</td>
*   </tr>
*   <tr>
*     <td>CRC-8 / ROHC</td><td>8</td><td>0x7</td><td>0xFF</td><td>1</td><td>0</td><td>1</td><td>0x0</td><td>0xD0</td><td>0x000000D0</td>
*   </tr>
*   <tr>
*     <td>CRC-8 / WCDMA</td><td>8</td><td>0x9B</td><td>0x0</td><td>1</td><td>0</td><td>1</td><td>0x0</td><td>0x25</td><td>0x00000025</td>
*   </tr>
*   <tr>
*     <td>CRC-10</td><td>10</td><td>0x233</td><td>0x0</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0x199</td><td>0x19900000</td>
*   </tr>
*   <tr>
*     <td>CRC-10 / CDMA2000</td><td>10</td><td>0x3D9</td><td>0x3FF</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0x233</td><td>0x23300000</td>
*   </tr>
*   <tr>
*     <td>CRC-11</td><td>11</td><td>0x385</td><td>0x1A</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0x5A3</td><td>0x5A300000</td>
*   </tr>
*   <tr>
*     <td>CRC-12 / 3GPP</td><td>12</td><td>0x80F</td><td>0x0</td><td>0</td><td>0</td><td>1</td><td>0x0</td><td>0xDAF</td><td>0x00000DAF</td>
*   </tr>
*   <tr>
*     <td>CRC-12 / CDMA2000</td><td>12</td><td>0xF13</td><td>0xFFF</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0xD4D</td><td>0xD4D00000</td>
*   </tr>
*   <tr>
*     <td>CRC-12 / DECT</td><td>12</td><td>0x80F</td><td>0x0</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0xF5B</td><td>0xF5B00000</td>
*   </tr>
*   <tr>
*     <td>CRC-13 / BBC</td><td>13</td><td>0x1CF5</td><td>0x0</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0x4FA</td><td>0x4FA00000</td>
*   </tr>
*   <tr>
*     <td>CRC-14 / DARC</td><td>14</td><td>0x805</td><td>0x0</td><td>1</td><td>0</td><td>1</td><td>0x0</td><td>0x82D</td><td>0x0000082D</td>
*   </tr>
*   <tr>
*     <td>CRC-15</td><td>15</td><td>0x4599</td><td>0x0</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0x59E</td><td>0x59E00000</td>
*   </tr>
*   <tr>
*     <td>CRC-15 / MPT1327</td><td>15</td><td>0x6815</td><td>0x0</td><td>0</td><td>0</td><td>0</td><td>0x1</td><td>0x2566</td><td>0x25660000</td>
*   </tr>
*   <tr>
*     <td>CRC-24</td><td>24</td><td>0x0864CFB</td><td>0x00B704CE</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0x21CF02</td><td>0x21CF0200</td>
*   </tr>
*   <tr>
*     <td>CRC-24 / FLEXRAY-A</td><td>24</td><td>0x05D6DCB</td><td>0x00FEDCBA</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0x7979BD</td><td>0x7979BD00</td>
*   </tr>
*   <tr>
*     <td>CRC-24 / FLEXRAY-B</td><td>24</td><td>0x05D6DCB</td><td>0x00ABCDEF</td><td>0</td><td>0</td><td>0</td><td>0x0</td><td>0x1F23B8</td><td>0x1F23B800</td>
*   </tr>
*   <tr>
*     <td>CRC-31 / PHILIPS</td><td>31</td><td>0x4C11DB7</td><td>0x7FFFFFFF</td><td>0</td><td>0</td><td>0</td><td>0x7FFFFFFF</td><td>0xCE9E46C</td><td>0xCE9E46C0</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / ARC</td><td>16</td><td>0x8005</td><td>0x0000</td><td>1</td><td>0</td><td>1</td><td>0x0000</td><td>0xBB3D</td><td>0x0000BB3D</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / AUG-CCITT</td><td>16</td><td>0x1021</td><td>0x1D0F</td><td>0</td><td>0</td><td>0</td><td>0x0000</td><td>0xE5CC</td><td>0xE5CC0000</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / BUYPASS</td><td>16</td><td>0x8005</td><td>0x0000</td><td>0</td><td>0</td><td>0</td><td>0x0000</td><td>0xFEE8</td><td>0xFEE80000</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / CCITT-0</td><td>16</td><td>0x1021</td><td>0xFFFF</td><td>0</td><td>0</td><td>0</td><td>0x0000</td><td>0x29B1</td><td>0x29B10000</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / CDMA2000</td><td>16</td><td>0xC867</td><td>0xFFFF</td><td>0</td><td>0</td><td>0</td><td>0x0000</td><td>0x4C06</td><td>0x4C060000</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / DDS-110</td><td>16</td><td>0x8005</td><td>0x800D</td><td>0</td><td>0</td><td>0</td><td>0x0000</td><td>0x9ECF</td><td>0x9ECF0000</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / DECT-R</td><td>16</td><td>0x0589</td><td>0x0000</td><td>0</td><td>0</td><td>0</td><td>0x0001</td><td>0x007E</td><td>0x007E0000</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / DECT-X</td><td>16</td><td>0x0589</td><td>0x0000</td><td>0</td><td>0</td><td>0</td><td>0x0000</td><td>0x007F</td><td>0x007F0000</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / DNP</td><td>16</td><td>0x3D65</td><td>0x0000</td><td>1</td><td>0</td><td>1</td><td>0xFFFF</td><td>0xEA82</td><td>0x0000EA82</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / EN-13757</td><td>16</td><td>0x3D65</td><td>0x0000</td><td>0</td><td>0</td><td>0</td><td>0xFFFF</td><td>0xC2B7</td><td>0xC2B70000</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / GENIBUS</td><td>16</td><td>0x1021</td><td>0xFFFF</td><td>0</td><td>0</td><td>0</td><td>0xFFFF</td><td>0xD64E</td><td>0xD64E0000</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / MAXIM</td><td>16</td><td>0x8005</td><td>0x0000</td><td>1</td><td>0</td><td>1</td><td>0xFFFF</td><td>0x44C2</td><td>0x000044C2</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / MCRF4XX</td><td>16</td><td>0x1021</td><td>0xFFFF</td><td>1</td><td>0</td><td>1</td><td>0x0000</td><td>0x6F91</td><td>0x00006F91</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / RIELLO</td><td>16</td><td>0x1021</td><td>0xB2AA</td><td>1</td><td>0</td><td>1</td><td>0x0000</td><td>0x63D0</td><td>0x000063D0</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / T10-DIF</td><td>16</td><td>0x8BB7</td><td>0x0000</td><td>0</td><td>0</td><td>0</td><td>0x0000</td><td>0xD0DB</td><td>0xD0DB0000</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / TELEDISK</td><td>16</td><td>0xA097</td><td>0x0000</td><td>0</td><td>0</td><td>0</td><td>0x0000</td><td>0x0FB3</td><td>0x0FB30000</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / TMS37157</td><td>16</td><td>0x1021</td><td>0x89EC</td><td>1</td><td>0</td><td>1</td><td>0x0000</td><td>0x26B1</td><td>0x000026B1</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / USB</td><td>16</td><td>0x8005</td><td>0xFFFF</td><td>1</td><td>0</td><td>1</td><td>0xFFFF</td><td>0xB4C8</td><td>0x0000B4C8</td>
*   </tr>
*   <tr>
*     <td>CRC-A</td><td>16</td><td>0x1021</td><td>0xC6C6</td><td>1</td><td>0</td><td>1</td><td>0x0000</td><td>0xBF05</td><td>0x0000BF05</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / KERMIT</td><td>16</td><td>0x1021</td><td>0x0000</td><td>1</td><td>0</td><td>1</td><td>0x0000</td><td>0x2189</td><td>0x00002189</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / MODBUS</td><td>16</td><td>0x8005</td><td>0xFFFF</td><td>1</td><td>0</td><td>1</td><td>0x0000</td><td>0x4B37</td><td>0x00004B37</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / X-25</td><td>16</td><td>0x1021</td><td>0xFFFF</td><td>1</td><td>0</td><td>1</td><td>0xFFFF</td><td>0x906E</td><td>0x0000906E</td>
*   </tr>
*   <tr>
*     <td>CRC-16 / XMODEM</td><td>16</td><td>0x1021</td><td>0x0000</td><td>0</td><td>0</td><td>0</td><td>0x0000</td><td>0x31C3</td><td>0x31C30000</td>
*   </tr>
*   <tr>
*     <td>CRC-32</td><td>32</td><td>0x04C11DB7</td><td>0xFFFFFFFF</td><td>1</td><td>0</td><td>1</td><td>0xFFFFFFFF</td><td>0xCBF43926</td><td>0xCBF43926</td>
*   </tr>
*   <tr>
*     <td>CRC-32 / BZIP2</td><td>32</td><td>0x04C11DB7</td><td>0xFFFFFFFF</td><td>0</td><td>0</td><td>0</td><td>0xFFFFFFFF</td><td>0xFC891918</td><td>0xFC891918</td>
*   </tr>
*   <tr>
*     <td>CRC-32C</td><td>32</td><td>0x1EDC6F41</td><td>0xFFFFFFFF</td><td>1</td><td>0</td><td>1</td><td>0xFFFFFFFF</td><td>0xE3069283</td><td>0xE3069283</td>
*   </tr>
*   <tr>
*     <td>CRC-32D</td><td>32</td><td>0xA833982B</td><td>0xFFFFFFFF</td><td>1</td><td>0</td><td>1</td><td>0xFFFFFFFF</td><td>0x87315576</td><td>0x87315576</td>
*   </tr>
*   <tr>
*     <td>CRC-32 / MPEG-2</td><td>32</td><td>0x04C11DB7</td><td>0xFFFFFFFF</td><td>0</td><td>0</td><td>0</td><td>0x00000000</td><td>0x0376E6E7</td><td>0x0376E6E7</td>
*   </tr>
*   <tr>
*     <td>CRC-32 / POSIX</td><td>32</td><td>0x04C11DB7</td><td>0x00000000</td><td>0</td><td>0</td><td>0</td><td>0xFFFFFFFF</td><td>0x765E7680</td><td>0x765E7680</td>
*   </tr>
*   <tr>
*     <td>CRC-32Q</td><td>32</td><td>0x814141AB</td><td>0x00000000</td><td>0</td><td>0</td><td>0</td><td>0x00000000</td><td>0x3010BF7F</td><td>0x3010BF7F</td>
*   </tr>
*   <tr>
*     <td>CRC-32 / JAMCRC</td><td>32</td><td>0x04C11DB7</td><td>0xFFFFFFFF</td><td>1</td><td>0</td><td>1</td><td>0x00000000</td><td>0x340BC6D9</td><td>0x340BC6D9</td>
*   </tr>
*   <tr>
*     <td>CRC-32 / XFER</td><td>32</td><td>0x000000AF</td><td>0x00000000</td><td>0</td><td>0</td><td>0</td><td>0x00000000</td><td>0xBD0BE338</td><td>0xBD0BE338</td>
*   </tr>
* </table>
*
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoCrcContext
* The pointer to the \ref cy_stc_crypto_context_crc_t structure which stores
* the Crypto driver context.
*
* \param polynomial
* The polynomial (specified using 32 bits) used in the computing CRC.
*
* \param dataReverse
* The order in which data bytes are processed. 0 - MSB first, 1- LSB first.
*
* \param dataXor
* The byte mask for xoring data
*
* \param remReverse
* A reminder reverse: 0 means the remainder is not reversed. 1 means - reversed.
*
* \param remXor
* Specifies a mask with which the LFSR32 register is XORed to produce a remainder.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Crc_Init(cy_stc_crypto_context_t *cryptoContext,
                                         cy_stc_crypto_context_crc_t *cryptoCrcContext,
                                         uint32_t polynomial,
                                         uint8_t  dataReverse,
                                         uint8_t  dataXor,
                                         uint8_t  remReverse,
                                         uint32_t remXor)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_CRC_INIT;
    cryptoContext->xdata = cryptoCrcContext;

    cryptoCrcContext->dataReverse = dataReverse;
    cryptoCrcContext->remReverse = remReverse;
    cryptoCrcContext->dataXor = dataXor;
    cryptoCrcContext->polynomial = polynomial;
    cryptoCrcContext->remXor = remXor;

    return (Cy_Crypto_Client_Send(cryptoContext));
}

