ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/crypto/cy_crypto.c
/*******************************************************************************
* Function Name: Cy_Crypto_Crc_Run
****************************************************************************//**
*
* Performs CRC calculation on a message.
* This function is dependent from Cy_Crypto_Crc_Init which should be called before.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoCrcContext
* The pointer to the \ref cy_stc_crypto_context_crc_t structure which stores
* the Crypto driver context.
*
* \param dataPtr
* The pointer to the message whose CRC is being computed.
*
* \param dataSize
* The size of a message in bytes.
*
* \param crcPtr
* The pointer to a computed CRC value.
*
* \param lfsrInitState
* The initial state of the LFSR.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Crc_Run(cy_stc_crypto_context_t *cryptoContext,
                                        cy_stc_crypto_context_crc_t *cryptoCrcContext,
                                        void* dataPtr,
                                        uint16_t  dataSize,
                                        uint32_t *crcPtr,
                                        uint32_t  lfsrInitState)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_CRC;
    cryptoContext->xdata = cryptoCrcContext;

    cryptoCrcContext->lfsrInitState = lfsrInitState;
    cryptoCrcContext->srcDataPtr = dataPtr;
    cryptoCrcContext->dataSize = dataSize;
    cryptoCrcContext->crcPtr = crcPtr;

    return(Cy_Crypto_Client_Send(cryptoContext));
}
#endif /* #if ((CPUSS_CRYPTO_CRC == 1) && (CY_CRYPTO_USER_CRC == 1)) */

#if ((CPUSS_CRYPTO_TR == 1) && (CY_CRYPTO_USER_TR == 1))
/*******************************************************************************
* Function Name: Cy_Crypto_Trng_Generate
****************************************************************************//**
*
* Generates a True Random Number.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoTrngContext
* The pointer to the \ref cy_stc_crypto_context_trng_t structure which stores
* the Crypto driver context.
*
* \param GAROPol;
* The polynomial for the programmable Galois ring oscillator.
*
* \param FIROPol;
* The polynomial for the programmable Fibonacci ring oscillator.
*
* \param max
* The maximum length of a random number, in the range [0, 32] Bits.
*
* \param rndNumPtr
* the pointer to a generated true random number.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Trng_Generate(cy_stc_crypto_context_t *cryptoContext,
                                              cy_stc_crypto_context_trng_t *cryptoTrngContext,
                                              uint32_t  GAROPol,
                                              uint32_t  FIROPol,
                                              uint32_t  max,
                                              uint32_t *rndNumPtr)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_TRNG;
    cryptoContext->xdata = cryptoTrngContext;

    cryptoTrngContext->GAROPol = GAROPol;
    cryptoTrngContext->GAROPol = FIROPol;
    cryptoTrngContext->max = max;
    cryptoTrngContext->trngNumPtr = rndNumPtr;

    return (Cy_Crypto_Client_Send(cryptoContext));
}
#endif /* #if ((CPUSS_CRYPTO_TR == 1) && (CY_CRYPTO_USER_TR == 1)) */

#if ((CPUSS_CRYPTO_DES == 1) && (CY_CRYPTO_USER_DES == 1))
/*******************************************************************************
* Function Name: Cy_Crypto_Des_Run
****************************************************************************//**
*
* Performs DES operation on a Single Block. All addresses must be 4-Byte aligned.
* Ciphertext (dstBlockPtr) may overlap with plaintext (srcBlockPtr)
* This function is independent from the previous Crypto state.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoDesContext
* The pointer to the cy_stc_crypto_context_des_t structure which stores
* the Crypto driver context.
*
* \param dirMode
* Can be CRYPTO_ENCRYPT or CRYPTO_DECRYPT
*
* \param keyPtr
* The pointer to the encryption/decryption key.
*
* \param srcBlockPtr
* The pointer to a source block. Must be 4-Byte aligned!
*
* \param dstBlockPtr
* The pointer to a destination cipher block.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Des_Run(cy_stc_crypto_context_t *cryptoContext,
                                        cy_stc_crypto_context_des_t *cryptoDesContext,
                                        cy_en_crypto_dir_mode_t dirMode,
                                        uint32_t *keyPtr,
                                        uint32_t *dstBlockPtr,
                                        uint32_t *srcBlockPtr)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_DES;
    cryptoContext->xdata = cryptoDesContext;

    cryptoDesContext->dirMode = dirMode;
    cryptoDesContext->keyPtr = keyPtr;
    cryptoDesContext->dstPtr = dstBlockPtr;
    cryptoDesContext->srcPtr = srcBlockPtr;

    return (Cy_Crypto_Client_Send(cryptoContext));
}

/*******************************************************************************
* Function Name: Cy_Crypto_Tdes_Run
****************************************************************************//**
*
* Performs TDES operation on a Single Block. All addresses must be 4-Byte aligned.
* Ciphertext (dstBlockPtr) may overlap with plaintext (srcBlockPtr)
* This function is independent from the previous Crypto state.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoDesContext
* The pointer to the cy_stc_crypto_context_des_t structure which stores
* the Crypto driver context.
*
* \param dirMode
* Can be CRYPTO_ENCRYPT or CRYPTO_DECRYPT.
*
* \param keyPtr
* The pointer to the encryption/decryption key.
*
* \param srcBlockPtr
* The pointer to a source block. Must be 4-Byte aligned!
*
* \param dstBlockPtr
* The pointer to a destination cipher block.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Tdes_Run(cy_stc_crypto_context_t *cryptoContext,
                                         cy_stc_crypto_context_des_t *cryptoDesContext,
                                         cy_en_crypto_dir_mode_t dirMode,
                                         uint32_t *keyPtr,
                                         uint32_t *dstBlockPtr,
                                         uint32_t *srcBlockPtr)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_3DES;
    cryptoContext->xdata = cryptoDesContext;

    cryptoDesContext->dirMode = dirMode;
    cryptoDesContext->keyPtr = keyPtr;
    cryptoDesContext->dstPtr = dstBlockPtr;
    cryptoDesContext->srcPtr = srcBlockPtr;

    return (Cy_Crypto_Client_Send(cryptoContext));
}
#endif /* #if ((CPUSS_CRYPTO_DES == 1) && (CY_CRYPTO_USER_DES == 1)) */

