ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/crypto/cy_crypto.c
#if ((CPUSS_CRYPTO_VU == 1) && (CY_CRYPTO_USER_VU == 1))
/*******************************************************************************
* Function Name: Cy_Crypto_Rsa_Proc
****************************************************************************//**
*
* Calculates (m^e mod modulo) where m is Message (Signature), e - public exponent
* using a public key in the next representation, it contains:
* modulo,
* public exponent,
* coefficient for Barrett reduction,
* binary inverse of the modulo,
* result of (2^moduloLength mod modulo)
*
* Not all fields in key must be given. Modulo and public exponent is mandatory;
* Barrett coefficient, inverse modulo and r-bar are optional.
* If they don't exists according pointers should be NULL. These coefficients
* could be calculated by \ref Cy_Crypto_Rsa_CalcCoefs.
* Their presence accelerates performance by 5 times.
*
* Returns the processed value and a success value.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoRsaContext
* The pointer to the \ref cy_stc_crypto_context_rsa_t structure which stores
* the RSA context.
*
* \param pubKeyPtr
* The pointer to the \ref cy_stc_crypto_rsa_pub_key_t structure which stores
* public key.
*
* \param messagePtr
* The pointer to the message to be processed.
*
* \param messageLength
* The length of the message to be processed.
*
* \param processedMessagePtr
* The pointer to processed message.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Rsa_Proc(cy_stc_crypto_context_t *cryptoContext,
                                         cy_stc_crypto_context_rsa_t *cryptoRsaContext,
                                         cy_stc_crypto_rsa_pub_key_t const *pubKeyPtr,
                                         uint32_t const *messageePtr,
                                         uint32_t messageLength,
                                         uint32_t const *processedMessagePtr)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_RSA_PROC;
    cryptoContext->xdata = cryptoRsaContext;

    cryptoRsaContext->keyPtr = (cy_stc_crypto_rsa_pub_key_t*)pubKeyPtr;
    cryptoRsaContext->messagePtr = messageePtr;
    cryptoRsaContext->messageLength = messageLength;
    cryptoRsaContext->resultPtr = processedMessagePtr;

    return(Cy_Crypto_Client_Send(cryptoContext));
}

/*******************************************************************************
* Function Name: Cy_Crypto_Rsa_CalcCoefs
****************************************************************************//**
*
* Calculates constant coefficients (which is dependent only on modulo
* and independent on message). With this pre-calculated coefficients calculations
* speed-up by 5 times.
*
* These coefficients are:
*                         coefficient for Barrett reduction,
*                         binary inverse of the modulo,
*                         result of (2^moduloLength mod modulo)
*
* Calculated coefficients will be placed by addresses provided in
* pubKeyPtr structure for according coefficients.
* Function overwrites previous values.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoRsaContext
* The pointer to the \ref cy_stc_crypto_context_rsa_t structure which stores
* the RSA context.
*
* \param pubKeyPtr
* The pointer to the \ref cy_stc_crypto_rsa_pub_key_t structure which stores
* public key.
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Rsa_CalcCoefs(cy_stc_crypto_context_t *cryptoContext,
                                              cy_stc_crypto_context_rsa_t *cryptoRsaContext,
                                              cy_stc_crypto_rsa_pub_key_t const *pubKeyPtr)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_RSA_COEF;
    cryptoContext->xdata = cryptoRsaContext;

    cryptoRsaContext->keyPtr = (cy_stc_crypto_rsa_pub_key_t*)pubKeyPtr;

    return(Cy_Crypto_Client_Send(cryptoContext));
}
#endif /* #if ((CPUSS_CRYPTO_VU == 1) && (CY_CRYPTO_USER_VU == 1)) */

#if (CY_CRYPTO_USER_PKCS1_5 == 1)
/*******************************************************************************
* Function Name: Cy_Crypto_Rsa_Verify
****************************************************************************//**
*
* RSA verification with checks for content, paddings and signature format.
* SHA digest of the message and decrypted message should be calculated before.
* Supports only PKCS1-v1_5 format, inside of this format supported padding
* using only SHA, cases with MD2 and MD5 are not supported.
*
* PKCS1-v1_5 described here, page 31:
* http://www.emc.com/collateral/white-papers/h11300-pkcs-1v2-2-rsa-cryptography-standard-wp.pdf
*
* Returns the verification result \ref cy_en_crypto_rsa_ver_result_t.
*
* \param cryptoContext
* The pointer to the \ref cy_stc_crypto_context_t structure which stores
* the Crypto driver common context.
*
* \param cryptoRsaVerContext
* The pointer to the \ref cy_stc_crypto_context_rsa_ver_t structure which stores
* the RSA context.
*
* \param verResult
* The pointer to the verification result \ref cy_en_crypto_rsa_ver_result_t.
*
* \param digestType
* SHA mode used for hash calculation \ref cy_en_crypto_sha_mode_t.
*
* \param digestPtr
* The pointer to the hash of message whose signature to be verified.
*
* \param decryptedSignaturePtr
* The pointer to decrypted signature to be verified.
*
* \param decryptedSignatureLength
* The length of the decrypted signature to be verified, in Bytes
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Rsa_Verify(cy_stc_crypto_context_t *cryptoContext,
                                           cy_stc_crypto_context_rsa_ver_t *cryptoRsaVerContext,
                                           cy_en_crypto_rsa_ver_result_t *verResult,
                                           cy_en_crypto_sha_mode_t digestType,
                                           uint32_t const *digestPtr,
                                           uint32_t const *decryptedSignaturePtr,
                                           uint32_t decryptedSignatureLength)
{
    cryptoContext->instr = CY_CRYPTO_INSTR_RSA_VER;
    cryptoContext->xdata = cryptoRsaVerContext;

    cryptoRsaVerContext->verResult = verResult;
    cryptoRsaVerContext->digestType = digestType;
    cryptoRsaVerContext->hashPtr = digestPtr;
    cryptoRsaVerContext->decryptedSignaturePtr = decryptedSignaturePtr;
    cryptoRsaVerContext->decryptedSignatureLength = decryptedSignatureLength;

    return(Cy_Crypto_Client_Send(cryptoContext));
}

/*******************************************************************************
* Function Name: Cy_Crypto_Rsa_InvertEndianness
****************************************************************************//**
*
* Inverts endianness in the memory range, like:
* inArr[0] <---> inArr[n]
* inArr[1] <---> inArr[n-1]
* inArr[2] <---> inArr[n-2]
* ........................
* inArr[n/2] <---> inArr[n/2-1]
*
* Odd or even byteSize are acceptable.
*
* \param inArrPtr
* The pointer to the memory whose endianness to be inverted.
*
* \param byteSize
* The length of the memory range whose endianness to be inverted, in Bytes
*
*******************************************************************************/
void Cy_Crypto_Rsa_InvertEndianness(void *inArrPtr, uint32_t byteSize)
{
    int32_t limit;
    int32_t i;
    int32_t j = 0;
    uint8_t temp;
    uint8_t *tempPtr = (uint8_t*)inArrPtr;

    if (byteSize > 1u)
    {
        limit = byteSize / 2u;
        if (0u == (byteSize % 2u))
        {
            limit -= 1u;
        }

        for (i = byteSize - 1u, j = 0u; i > limit; i--, j++)
        {
            temp = tempPtr[j];
            tempPtr[j] = tempPtr[i];
            tempPtr[i] = temp;
        }
    }
}

#endif /* #if (CY_CRYPTO_USER_PKCS1_5 == 1) */


#if defined(__cplusplus)
}
#endif


#endif /* #if (CPUSS_CRYPTO_PRESENT == 1) */

/* [] END OF FILE */
